eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_core.c
/***************************************************************************//**
 * @file
 * @brief Core interrupt handling API
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/
#include "em_core.h"
#include "em_assert.h"

#if defined(EMLIB_USER_CONFIG)
#include "emlib_config.h"
#endif

/* *INDENT-OFF* */
// *****************************************************************************
///  @addtogroup core CORE - Core Interrupt
///  @brief Core interrupt handling API
///
///  @li @ref core_intro
///  @li @ref core_conf
///  @li @ref core_macro_api
///  @li @ref core_reimplementation
///  @li @ref core_vector_tables
///  @li @ref core_examples
///  @li @ref core_porting
///
///@n @section core_intro Introduction
///
///  CORE interrupt API provides a simple and safe means
///  to disable and enable interrupts to protect sections of code.
///
///  This is often referred to as "critical sections". This module provides
///  support for three types of critical sections, each with different interrupt
///  blocking capabilities.
///
///  @li <b>CRITICAL</b> section: Inside a critical section, all interrupts are
///      disabled (except for fault handlers). The PRIMASK register is always used for
///      interrupt disable/enable.
///  @li <b>ATOMIC</b> section: This type of section is configurable and the default
///      method is to use PRIMASK. With BASEPRI configuration, interrupts with priority
///      equal to or lower than a given configurable level are disabled. The interrupt
///      disable priority level is defined at compile time. The BASEPRI register is not
///      available for all architectures.
///  @li <b>NVIC mask</b> section: Disable NVIC (external interrupts) on an
///      individual manner.
///
///  em_core also has an API for manipulating RAM-based interrupt vector tables.
///
///@n @section core_conf Compile-time Configuration
///
///  The following @htmlonly #defines @endhtmlonly are used to configure em_core:
///  @code{.c}
///  // The interrupt priority level used inside ATOMIC sections.
///  #define CORE_ATOMIC_BASE_PRIORITY_LEVEL    3
///
///  // A method used for interrupt disable/enable within ATOMIC sections.
///  #define CORE_ATOMIC_METHOD                 CORE_ATOMIC_METHOD_PRIMASK
///  @endcode
///
///  If the default values do not support your needs, they can be overridden
///  by supplying -D compiler flags on the compiler command line or by collecting
///  all macro redefinitions in a file named @em emlib_config.h and then supplying
///  -DEMLIB_USER_CONFIG on a compiler command line.
///
///  @note The default emlib configuration for ATOMIC section interrupt disable
///        method is using PRIMASK, i.e., ATOMIC sections are implemented as
///        CRITICAL sections.
///
///  @note Due to architectural limitations Cortex-M0+ devices do not support
///        ATOMIC type critical sections using the BASEPRI register. On M0+
///        devices ATOMIC section helper macros are available but they are
///        implemented as CRITICAL sections using PRIMASK register.
///
///@n @section core_macro_api Macro API
///
///  The primary em_core API is the macro API. Macro API will map to correct
///  CORE functions according to the selected @ref CORE_ATOMIC_METHOD and similar
///  configurations (the full CORE API is of course also available).
///  The most useful macros are as follows:
///
///  @ref CORE_DECLARE_IRQ_STATE @n @ref CORE_ENTER_ATOMIC() @n
///  @ref CORE_EXIT_ATOMIC()@n
///  Used together to implement an ATOMIC section.
///  @code{.c}
///  {
///    CORE_DECLARE_IRQ_STATE;           // Storage for saving IRQ state prior to
///                                      // atomic section entry.
///
///    CORE_ENTER_ATOMIC();              // Enter atomic section.
///
///    ...
///    ... your code goes here ...
///    ...
///
///    CORE_EXIT_ATOMIC();               // Exit atomic section, IRQ state is restored.
///  }
///  @endcode
///
///  @n @ref CORE_ATOMIC_SECTION(yourcode)@n
///  A concatenation of all three macros above.
///  @code{.c}
///  {
///    CORE_ATOMIC_SECTION(
///      ...
///      ... your code goes here ...
///      ...
///    )
///  }
///  @endcode
///
///  @n @ref CORE_DECLARE_IRQ_STATE @n @ref CORE_ENTER_CRITICAL() @n
///  @ref CORE_EXIT_CRITICAL() @n @ref CORE_CRITICAL_SECTION(yourcode)@n
///  These macros implement CRITICAL sections in a similar fashion as described
///  above for ATOMIC sections.
///
///  @n @ref CORE_DECLARE_NVIC_STATE @n @ref CORE_ENTER_NVIC() @n
///  @ref CORE_EXIT_NVIC() @n @ref CORE_NVIC_SECTION(yourcode)@n
///  These macros implement NVIC mask sections in a similar fashion as described
///  above for ATOMIC sections. See @ref core_examples for an example.
///
///  Refer to @em Macros or <em>Macro Definition Documentation</em> below for a
///  full list of macros.
///
///@n @section core_reimplementation API reimplementation
///
///  Most of the functions in the API are implemented as weak functions. This means
///  that it is easy to reimplement when special needs arise. Shown below is a
///  reimplementation of CRITICAL sections suitable if FreeRTOS OS is used:
///  @code{.c}
///  CORE_irqState_t CORE_EnterCritical(void)
///  {
///    vPortEnterCritical();
///    return 0;
///  }
///
///  void CORE_ExitCritical(CORE_irqState_t irqState)
///  {
///    (void)irqState;
///    vPortExitCritical();
///  }
///  @endcode
///  Also note that CORE_Enter/ExitCritical() are not implemented as inline
///  functions. As a result, reimplementations will be possible even when original
///  implementations are inside a linked library.
///
///  Some RTOSes must be notified on interrupt handler entry and exit. Macros
///  @ref CORE_INTERRUPT_ENTRY() and @ref CORE_INTERRUPT_EXIT() are suitable
///  placeholders for inserting such code. Insert these macros in all your
///  interrupt handlers and then override the default macro implementations.
///  This is an example if uC/OS is used:
///  @code{.c}
///  // In emlib_config.h:
///
///  #define CORE_INTERRUPT_ENTRY()   OSIntEnter()
///  #define CORE_INTERRUPT_EXIT()    OSIntExit()
///  @endcode
///
///@n @section core_vector_tables Interrupt vector tables
///
///  When using RAM based interrupt vector tables it is the user's responsibility
///  to allocate the table space correctly. The tables must be aligned as specified
///  in the CPU reference manual.
///
///  @ref CORE_InitNvicVectorTable()@n
///  Initialize a RAM based vector table by copying table entries from a source
///  vector table to a target table. VTOR is set to the address of the target
///  vector table.
///
///  @n @ref CORE_GetNvicRamTableHandler() @n @ref CORE_SetNvicRamTableHandler()@n
///  Use these functions to get or set the interrupt handler for a specific IRQn.
///  They both use the interrupt vector table defined by the current
///  VTOR register value.
///
///@n @section core_examples Examples
///
///  Implement an NVIC critical section:
///  @code{.c}
///  {
///    CORE_DECLARE_NVIC_ZEROMASK(mask); // A zero initialized NVIC disable mask
///
///    // Set mask bits for IRQs to block in the NVIC critical section.
///    // In many cases, you can create the disable mask once upon application
///    // startup and use the mask globally throughout the application lifetime.
///    CORE_NvicMaskSetIRQ(LEUART0_IRQn, &mask);
///    CORE_NvicMaskSetIRQ(VCMP_IRQn,    &mask);
///
///    // Enter NVIC critical section with the disable mask
///    CORE_NVIC_SECTION(&mask,
///      ...
///      ... your code goes here ...
///      ...
///    )
///  }
///  @endcode
///
///@n @section core_porting Porting from em_int
///
///  Existing code using INT_Enable() and INT_Disable() must be ported to the
///  em_core API. While em_int used, a global counter to store the interrupt state,
///  em_core uses a local variable. Any usage of INT_Disable(), therefore, needs to
///  be replaced with a declaration of the interrupt state variable before entering
///  the critical section.
///
///  Since the state variable is in local scope, the critical section exit
///  needs to occur within the scope of the variable. If multiple nested critical
///  sections are used, each needs to have its own state variable in its own scope.
///
///  In many cases, completely disabling all interrupts using CRITICAL sections
///  might be more heavy-handed than needed. When porting, consider whether other
///  types of sections, such as ATOMIC or NVIC mask, can be used to only disable
///  a subset of the interrupts.
///
///  Replacing em_int calls with em_core function calls:
///  @code{.c}
///  void func(void)
///  {
///    // INT_Disable();
///    CORE_DECLARE_IRQ_STATE;
///    CORE_ENTER_ATOMIC();
///      .
///      .
///      .
///    // INT_Enable();
///    CORE_EXIT_ATOMIC();
///  }
///  @endcode
/// @{
// *****************************************************************************
/* *INDENT-ON* */

